{
  "common": {
    "skip": "Skip Tour",
    "next": "Next",
    "back": "Back",
    "finish": "Finish",
    "close": "Close",
    "startTour": "Start Tour",
    "resumeTour": "Resume Tour",
    "tourCompleted": "Tour Completed!",
    "restartTour": "Restart Tour"
  },
  "categories": {
    "operations": "Operations",
    "management": "Management",
    "administration": "Administration"
  },
  "dailyLogs": {
    "list": {
      "title": "Daily Logs Tour",
      "description": "Learn how to manage and track daily water treatment logs",
      "steps": {
        "welcome": {
          "title": "Welcome to Daily Logs!",
          "content": "Daily logs are where you record field measurements and laboratory results for your water treatment systems. Let's explore how to manage them effectively!"
        },
        "header": {
          "title": "Daily Logs Page",
          "content": "This page shows all your daily logs - both field measurements and laboratory analysis. You can view, filter, and export your records from here."
        },
        "viewMode": {
          "title": "View Mode Toggle",
          "content": "Switch between table view (detailed list) and chart view (visual graphs) to analyze your data in different ways. Perfect for spotting trends!"
        },
        "export": {
          "title": "Export Your Data",
          "content": "Export your daily logs to PDF, HTML, or CSV format for reports, compliance documentation, or offline analysis."
        },
        "newLog": {
          "title": "Create New Log",
          "content": "Click here to record a new daily log - either field measurements taken on-site or laboratory analysis results."
        },
        "filters": {
          "title": "Filter Your Logs",
          "content": "Use filters to find specific logs by system, stage, record type (field/lab), or date range. Great for focused analysis!"
        },
        "table": {
          "title": "Daily Logs Table",
          "content": "View all your logs with key details: type, date, system, period, laboratory, recorded by, and number of entries. Alerts show if any parameters are out of range. Click any row to see full details."
        },
        "pagination": {
          "title": "Navigation",
          "content": "Navigate through multiple pages of logs and adjust how many records are shown per page."
        },
        "complete": {
          "title": "Daily Logs Mastered!",
          "content": "You now know how to manage daily logs effectively. Start recording your water treatment data to keep track of system performance!"
        }
      }
    },
    "new": {
      "title": "Create Daily Log Tour",
      "description": "Learn how to record field measurements and laboratory results",
      "steps": {
        "welcome": {
          "title": "Record a New Daily Log!",
          "content": "This form helps you record daily water treatment data - either field measurements taken on-site or laboratory analysis results. Let's walk through it!"
        },
        "header": {
          "title": "New Log Form",
          "content": "This page lets you create a new daily log entry. You can record field measurements or laboratory analysis for any of your systems."
        },
        "actionButtons": {
          "title": "Save or Cancel",
          "content": "Use these buttons to save your daily log when you're done, or cancel to go back without saving changes."
        },
        "recordType": {
          "title": "Record Type",
          "content": "Choose between Field Record (measurements taken on-site) or Laboratory Record (analysis performed in a lab). This determines which fields you'll need to fill."
        },
        "systemSelection": {
          "title": "Select System",
          "content": "Choose which water treatment system you're recording data for. If the system has stages, you can optionally select a specific stage."
        },
        "datePeriod": {
          "title": "Date and Period",
          "content": "Enter the date of the measurement and optionally specify the period (morning, afternoon, etc.). You can also add the exact time if needed."
        },
        "monitoringValues": {
          "title": "Enter Measurements",
          "content": "Record values for each monitoring point. You'll see the parameter name, unit, and acceptable range. Enter at least one value to save the log. Out-of-range values will trigger alerts!"
        },
        "complete": {
          "title": "Ready to Record!",
          "content": "You now know how to create daily logs. Fill in the required information and monitoring values, then click Save to record your data!"
        }
      }
    },
    "detail": {
      "title": "Daily Log Details Tour",
      "description": "Learn how to review daily log entries and monitoring values",
      "steps": {
        "welcome": {
          "title": "View Daily Log Details!",
          "content": "This page shows complete details of a daily log entry, including all monitoring values and their status. Let's explore what information is available!"
        },
        "header": {
          "title": "Log Overview",
          "content": "See the log type (field/laboratory), date, and system name at a glance. This gives you quick context about the record you're viewing."
        },
        "recordInfo": {
          "title": "Record Information",
          "content": "View all details about this log: record type, system, date, period, time, and who recorded it. For laboratory records, you'll also see the lab name and collection details. The status badge alerts you if any parameters are out of range."
        },
        "monitoringEntries": {
          "title": "Monitoring Values",
          "content": "See all recorded measurements with their monitoring point, value, expected range, and status. Out-of-range values are highlighted in red with a danger badge, making it easy to spot issues that need attention!"
        },
        "complete": {
          "title": "Details Reviewed!",
          "content": "You now know how to review daily log details. Use this page to analyze recorded data, check for out-of-range values, and ensure system performance is on track!"
        }
      }
    }
  },
  "dashboard": {
    "title": "Dashboard Tour",
    "description": "Learn how to use the main dashboard and understand key metrics",
    "steps": {
      "welcome": {
        "title": "Welcome to LINCE!",
        "content": "Let's take a quick tour of your dashboard. You'll learn how to view statistics, monitor recent activity, and track alerts. Click 'Next' to begin."
      },
      "header": {
        "title": "Dashboard Header",
        "content": "This is your dashboard header showing the current view and your user information. You can see a personalized welcome message here."
      },
      "viewMode": {
        "title": "View Mode Toggle",
        "content": "Switch between table view (detailed lists) and chart view (visual graphs) to see your data in different formats. Try clicking this button!"
      },
      "export": {
        "title": "Export Options",
        "content": "Export your dashboard data to PDF, HTML, or CSV formats for reports and record-keeping. Perfect for sharing with your team or keeping archives."
      },
      "stats": {
        "title": "Statistics Overview",
        "content": "These cards show key metrics for your water treatment systems: total systems, daily logs, inspections, incidents, and alerts. Monitor everything at a glance!"
      },
      "recentActivity": {
        "title": "Recent Activity",
        "content": "View your most recent daily logs, inspections, and incidents in one place. Click any item to see more details."
      },
      "alerts": {
        "title": "Active Alerts",
        "content": "Critical alerts and notifications appear here. Keep an eye on out-of-range parameters, low stock items, and unread notifications."
      },
      "sidebar": {
        "title": "Main Navigation",
        "content": "Use the sidebar to navigate between different sections: Daily Logs, Inspections, Incidents, Systems, Reports, and more. All your tools are just one click away!"
      },
      "complete": {
        "title": "You're All Set!",
        "content": "Great job! You now know the basics of the dashboard. Explore other sections to learn more, or click 'Finish' to start using LINCE."
      }
    }
  },
  "clients": {
    "list": {
      "title": "Clients Management Tour",
      "description": "Learn how to manage your clients and their information",
      "steps": {
        "welcome": {
          "title": "Welcome to Client Management!",
          "content": "This tour will show you how to manage clients, add new ones, and keep track of all client information. Let's get started!"
        },
        "header": {
          "title": "Clients Page Header",
          "content": "See an overview of your client management section. The header shows the total number of clients you're managing."
        },
        "addButton": {
          "title": "Add New Client",
          "content": "Click here to add a new client. You'll be able to enter all their information including name, contact details, and address."
        },
        "search": {
          "title": "Search Clients",
          "content": "Quickly find clients by typing their name, email, or phone number. The results update as you type!"
        },
        "table": {
          "title": "Clients Table",
          "content": "View all your clients in this organized table. You can see their name, contact person, email, phone, and current status. Click any row to view full details."
        },
        "actions": {
          "title": "Client Actions",
          "content": "Click the menu icon to edit client information, manage their users, or delete the client if needed."
        },
        "pagination": {
          "title": "Pagination",
          "content": "Navigate through multiple pages of clients and adjust how many clients are shown per page."
        },
        "complete": {
          "title": "Client Management Mastered!",
          "content": "You now know how to manage your clients effectively. Try adding a new client or exploring their details!"
        }
      }
    },
    "add": {
      "title": "Add Client Tour",
      "description": "Step-by-step guide to adding a new client",
      "steps": {
        "welcome": {
          "title": "Let's Add a New Client!",
          "content": "This form will help you register a new client with all their essential information. We'll guide you through each section."
        },
        "form": {
          "title": "Client Information Form",
          "content": "Fill out this form with your client's details. All required fields are marked with an asterisk (*)."
        },
        "basicInfo": {
          "title": "Basic Information",
          "content": "Enter the client's name and select whether they are currently active. You can also upload a logo if available."
        },
        "contactInfo": {
          "title": "Contact Information",
          "content": "Provide contact details including the contact person's name, email, phone, and physical address for the client."
        },
        "submit": {
          "title": "Save Client",
          "content": "Once you've filled in all the required information, click here to save the new client. You'll be redirected to the client details page."
        },
        "complete": {
          "title": "Client Addition Complete!",
          "content": "Great! You now know how to add new clients. Make sure to keep their information up to date."
        }
      }
    },
    "detail": {
      "title": "Client Details Tour",
      "description": "Explore client details and management options",
      "steps": {
        "welcome": {
          "title": "Client Details Page!",
          "content": "Here you can view and manage all information about this client. Let's explore what you can do."
        },
        "header": {
          "title": "Client Header",
          "content": "View the client's name, logo, and status at a glance. This header provides quick identification."
        },
        "info": {
          "title": "Client Information",
          "content": "See all the client's details including contact information, address, and other important data organized in sections."
        },
        "edit": {
          "title": "Edit Client",
          "content": "Click here to modify any of the client's information. You can update contact details, status, or upload a new logo."
        },
        "users": {
          "title": "Manage Users",
          "content": "Add, edit, or remove users associated with this client. Control who has access to their systems and data."
        },
        "complete": {
          "title": "Client Details Explored!",
          "content": "You're now familiar with the client details page. Keep your client information accurate and up to date!"
        }
      }
    },
    "users": {
      "title": "Client Users Tour",
      "description": "Learn how to manage user access to clients",
      "steps": {
        "welcome": {
          "title": "Client User Management!",
          "content": "Control who has access to this client and their permission levels. Let's see how it works!"
        },
        "header": {
          "title": "Users Page Header",
          "content": "View the client name and manage all users who have access to this client's data."
        },
        "addButton": {
          "title": "Add User Access",
          "content": "Click here to grant a user access to this client. You can select from available users and set their access level."
        },
        "table": {
          "title": "Users Table",
          "content": "See all users who have access to this client, their roles, and current access levels. You can modify permissions or remove access from here."
        },
        "accessLevel": {
          "title": "Access Levels",
          "content": "Change user access levels: View Only (read-only), Edit (create & modify data), or Admin (full access including user management)."
        },
        "complete": {
          "title": "User Management Complete!",
          "content": "You now know how to control user access to clients. Keep permissions up to date for security!"
        }
      }
    },
    "firstSetup": {
      "title": "First Client Setup Tour",
      "description": "Welcome! Let's add your first client to get started",
      "steps": {
        "welcome": {
          "title": "Welcome to LINCE!",
          "content": "Great to have you here! Before you can start managing water treatment systems, you need to add your first client. This quick tour will guide you through the process."
        },
        "header": {
          "title": "Getting Started",
          "content": "This page helps you add your first client. A client represents an organization or location you'll be managing water treatment systems for."
        },
        "form": {
          "title": "Client Information Form",
          "content": "Fill out this simple form with your client's basic information. Only the client name is required to get started - you can always add more details later."
        },
        "requiredFields": {
          "title": "Client Name (Required)",
          "content": "Enter the name of your client. This is the only required field. The client name will appear throughout the system when you're managing their water treatment systems."
        },
        "contactFields": {
          "title": "Contact Information (Optional)",
          "content": "Add contact details like address, contact person, phone, and email. These are optional but helpful for keeping all client information in one place."
        },
        "submit": {
          "title": "Add Client & Continue",
          "content": "Once you've entered at least the client name, click here to save your first client and continue to the dashboard. You'll be able to add more clients later!"
        },
        "complete": {
          "title": "You're All Set!",
          "content": "Perfect! You now know how to add your first client. Once you submit this form, you'll be taken to the dashboard where you can start managing water treatment systems."
        }
      }
    }
  }
}
