{
  "common": {
    "skip": "Pular Tour",
    "next": "Próximo",
    "back": "Voltar",
    "finish": "Concluir",
    "close": "Fechar",
    "startTour": "Iniciar Tour",
    "resumeTour": "Retomar Tour",
    "tourCompleted": "Tour Concluído!",
    "restartTour": "Reiniciar Tour"
  },
  "categories": {
    "operations": "Operações",
    "management": "Gestão",
    "administration": "Administração"
  },
  "dailyLogs": {
    "list": {
      "title": "Tour de Registros Diários",
      "description": "Aprenda a gerenciar e rastrear registros diários de tratamento de água",
      "steps": {
        "welcome": {
          "title": "Bem-vindo aos Registros Diários!",
          "content": "Os registros diários são onde você registra medições de campo e resultados de laboratório para seus sistemas de tratamento de água. Vamos explorar como gerenciá-los de forma eficaz!"
        },
        "header": {
          "title": "Página de Registros Diários",
          "content": "Esta página mostra todos os seus registros diários - tanto medições de campo quanto análises de laboratório. Você pode visualizar, filtrar e exportar seus registros daqui."
        },
        "viewMode": {
          "title": "Alternar Modo de Visualização",
          "content": "Alterne entre visualização em tabela (lista detalhada) e visualização em gráfico (gráficos visuais) para analisar seus dados de diferentes maneiras. Perfeito para identificar tendências!"
        },
        "export": {
          "title": "Exportar Seus Dados",
          "content": "Exporte seus registros diários para formato PDF, HTML ou CSV para relatórios, documentação de conformidade ou análise offline."
        },
        "newLog": {
          "title": "Criar Novo Registro",
          "content": "Clique aqui para registrar um novo registro diário - seja medições de campo feitas no local ou resultados de análise de laboratório."
        },
        "filters": {
          "title": "Filtrar Seus Registros",
          "content": "Use filtros para encontrar registros específicos por sistema, etapa, tipo de registro (campo/laboratório) ou intervalo de datas. Ótimo para análise focada!"
        },
        "table": {
          "title": "Tabela de Registros Diários",
          "content": "Veja todos os seus registros com detalhes principais: tipo, data, sistema, período, laboratório, registrado por e número de entradas. Alertas mostram se algum parâmetro está fora da faixa. Clique em qualquer linha para ver detalhes completos."
        },
        "pagination": {
          "title": "Navegação",
          "content": "Navegue por várias páginas de registros e ajuste quantos registros são mostrados por página."
        },
        "complete": {
          "title": "Registros Diários Dominados!",
          "content": "Agora você sabe como gerenciar registros diários de forma eficaz. Comece a registrar seus dados de tratamento de água para acompanhar o desempenho do sistema!"
        }
      }
    },
    "new": {
      "title": "Tour de Criar Registro Diário",
      "description": "Aprenda a registrar medições de campo e resultados de laboratório",
      "steps": {
        "welcome": {
          "title": "Registre um Novo Registro Diário!",
          "content": "Este formulário ajuda você a registrar dados diários de tratamento de água - seja medições de campo feitas no local ou resultados de análise de laboratório. Vamos percorrê-lo!"
        },
        "header": {
          "title": "Formulário de Novo Registro",
          "content": "Esta página permite criar uma nova entrada de registro diário. Você pode registrar medições de campo ou análise de laboratório para qualquer um dos seus sistemas."
        },
        "actionButtons": {
          "title": "Salvar ou Cancelar",
          "content": "Use estes botões para salvar seu registro diário quando terminar, ou cancelar para voltar sem salvar as alterações."
        },
        "recordType": {
          "title": "Tipo de Registro",
          "content": "Escolha entre Registro de Campo (medições feitas no local) ou Registro de Laboratório (análise realizada em laboratório). Isso determina quais campos você precisará preencher."
        },
        "systemSelection": {
          "title": "Selecionar Sistema",
          "content": "Escolha para qual sistema de tratamento de água você está registrando dados. Se o sistema tiver etapas, você pode opcionalmente selecionar uma etapa específica."
        },
        "datePeriod": {
          "title": "Data e Período",
          "content": "Digite a data da medição e opcionalmente especifique o período (manhã, tarde, etc.). Você também pode adicionar a hora exata se necessário."
        },
        "monitoringValues": {
          "title": "Digite as Medições",
          "content": "Registre valores para cada ponto de monitoramento. Você verá o nome do parâmetro, unidade e faixa aceitável. Digite pelo menos um valor para salvar o registro. Valores fora da faixa dispararão alertas!"
        },
        "complete": {
          "title": "Pronto para Registrar!",
          "content": "Agora você sabe como criar registros diários. Preencha as informações obrigatórias e valores de monitoramento, depois clique em Salvar para registrar seus dados!"
        }
      }
    },
    "detail": {
      "title": "Tour de Detalhes do Registro Diário",
      "description": "Aprenda a revisar entradas de registros diários e valores de monitoramento",
      "steps": {
        "welcome": {
          "title": "Visualizar Detalhes do Registro Diário!",
          "content": "Esta página mostra detalhes completos de uma entrada de registro diário, incluindo todos os valores de monitoramento e seu status. Vamos explorar quais informações estão disponíveis!"
        },
        "header": {
          "title": "Visão Geral do Registro",
          "content": "Veja o tipo de registro (campo/laboratório), data e nome do sistema rapidamente. Isso fornece contexto rápido sobre o registro que você está visualizando."
        },
        "recordInfo": {
          "title": "Informações do Registro",
          "content": "Visualize todos os detalhes sobre este registro: tipo de registro, sistema, data, período, hora e quem registrou. Para registros de laboratório, você também verá o nome do laboratório e detalhes da coleta. O emblema de status alerta se algum parâmetro está fora da faixa."
        },
        "monitoringEntries": {
          "title": "Valores de Monitoramento",
          "content": "Veja todas as medições registradas com seu ponto de monitoramento, valor, faixa esperada e status. Valores fora da faixa são destacados em vermelho com um emblema de perigo, facilitando a identificação de problemas que precisam de atenção!"
        },
        "complete": {
          "title": "Detalhes Revisados!",
          "content": "Agora você sabe como revisar detalhes de registros diários. Use esta página para analisar dados registrados, verificar valores fora da faixa e garantir que o desempenho do sistema está no caminho certo!"
        }
      }
    }
  },
  "dashboard": {
    "title": "Tour do Painel",
    "description": "Aprenda a usar o painel principal e entender as métricas principais",
    "steps": {
      "welcome": {
        "title": "Bem-vindo ao LINCE!",
        "content": "Vamos fazer um tour rápido do seu painel. Você vai aprender como visualizar estatísticas, monitorar atividades recentes e acompanhar alertas. Clique em 'Próximo' para começar."
      },
      "header": {
        "title": "Cabeçalho do Painel",
        "content": "Este é o cabeçalho do seu painel mostrando a visualização atual e suas informações de usuário. Você pode ver uma mensagem de boas-vindas personalizada aqui."
      },
      "viewMode": {
        "title": "Alternar Modo de Visualização",
        "content": "Alterne entre visualização em tabela (listas detalhadas) e visualização em gráfico (gráficos visuais) para ver seus dados em diferentes formatos. Experimente clicar neste botão!"
      },
      "export": {
        "title": "Opções de Exportação",
        "content": "Exporte os dados do seu painel para formatos PDF, HTML ou CSV para relatórios e manutenção de registros. Perfeito para compartilhar com sua equipe ou manter arquivos."
      },
      "stats": {
        "title": "Visão Geral das Estatísticas",
        "content": "Estes cartões mostram as métricas principais dos seus sistemas de tratamento de água: total de sistemas, registros diários, inspeções, incidentes e alertas. Monitore tudo de relance!"
      },
      "recentActivity": {
        "title": "Atividade Recente",
        "content": "Veja seus registros diários, inspeções e incidentes mais recentes em um só lugar. Clique em qualquer item para ver mais detalhes."
      },
      "alerts": {
        "title": "Alertas Ativos",
        "content": "Alertas críticos e notificações aparecem aqui. Fique de olho em parâmetros fora da faixa, itens com estoque baixo e notificações não lidas."
      },
      "sidebar": {
        "title": "Navegação Principal",
        "content": "Use a barra lateral para navegar entre diferentes seções: Registros Diários, Inspeções, Incidentes, Sistemas, Relatórios e mais. Todas as suas ferramentas estão a apenas um clique de distância!"
      },
      "complete": {
        "title": "Tudo Pronto!",
        "content": "Ótimo trabalho! Agora você conhece o básico do painel. Explore outras seções para aprender mais, ou clique em 'Concluir' para começar a usar o LINCE."
      }
    }
  },
  "clients": {
    "list": {
      "title": "Tour de Gestão de Clientes",
      "description": "Aprenda a gerenciar seus clientes e suas informações",
      "steps": {
        "welcome": {
          "title": "Bem-vindo à Gestão de Clientes!",
          "content": "Este tour mostrará como gerenciar clientes, adicionar novos e manter o controle de todas as informações dos clientes. Vamos começar!"
        },
        "header": {
          "title": "Cabeçalho da Página de Clientes",
          "content": "Veja uma visão geral da sua seção de gestão de clientes. O cabeçalho mostra o número total de clientes que você está gerenciando."
        },
        "addButton": {
          "title": "Adicionar Novo Cliente",
          "content": "Clique aqui para adicionar um novo cliente. Você poderá inserir todas as informações, incluindo nome, detalhes de contato e endereço."
        },
        "search": {
          "title": "Buscar Clientes",
          "content": "Encontre clientes rapidamente digitando seu nome, e-mail ou número de telefone. Os resultados são atualizados conforme você digita!"
        },
        "table": {
          "title": "Tabela de Clientes",
          "content": "Visualize todos os seus clientes nesta tabela organizada. Você pode ver nome, pessoa de contato, e-mail, telefone e status atual. Clique em qualquer linha para ver detalhes completos."
        },
        "actions": {
          "title": "Ações do Cliente",
          "content": "Clique no ícone de menu para editar informações do cliente, gerenciar seus usuários ou excluir o cliente, se necessário."
        },
        "pagination": {
          "title": "Paginação",
          "content": "Navegue por várias páginas de clientes e ajuste quantos clientes são mostrados por página."
        },
        "complete": {
          "title": "Gestão de Clientes Dominada!",
          "content": "Agora você sabe como gerenciar seus clientes de forma eficaz. Experimente adicionar um novo cliente ou explorar seus detalhes!"
        }
      }
    },
    "add": {
      "title": "Tour de Adicionar Cliente",
      "description": "Guia passo a passo para adicionar um novo cliente",
      "steps": {
        "welcome": {
          "title": "Vamos Adicionar um Novo Cliente!",
          "content": "Este formulário ajudará você a registrar um novo cliente com todas as informações essenciais. Vamos orientá-lo em cada seção."
        },
        "form": {
          "title": "Formulário de Informações do Cliente",
          "content": "Preencha este formulário com os detalhes do seu cliente. Todos os campos obrigatórios estão marcados com um asterisco (*)."
        },
        "basicInfo": {
          "title": "Informações Básicas",
          "content": "Digite o nome do cliente e selecione se ele está ativo no momento. Você também pode fazer upload de um logotipo, se disponível."
        },
        "contactInfo": {
          "title": "Informações de Contato",
          "content": "Forneça detalhes de contato, incluindo nome da pessoa de contato, e-mail, telefone e endereço físico do cliente."
        },
        "submit": {
          "title": "Salvar Cliente",
          "content": "Depois de preencher todas as informações obrigatórias, clique aqui para salvar o novo cliente. Você será redirecionado para a página de detalhes do cliente."
        },
        "complete": {
          "title": "Adição de Cliente Concluída!",
          "content": "Ótimo! Agora você sabe como adicionar novos clientes. Certifique-se de manter suas informações atualizadas."
        }
      }
    },
    "detail": {
      "title": "Tour de Detalhes do Cliente",
      "description": "Explore detalhes e opções de gerenciamento do cliente",
      "steps": {
        "welcome": {
          "title": "Página de Detalhes do Cliente!",
          "content": "Aqui você pode visualizar e gerenciar todas as informações sobre este cliente. Vamos explorar o que você pode fazer."
        },
        "header": {
          "title": "Cabeçalho do Cliente",
          "content": "Veja o nome, logotipo e status do cliente rapidamente. Este cabeçalho fornece identificação rápida."
        },
        "info": {
          "title": "Informações do Cliente",
          "content": "Veja todos os detalhes do cliente, incluindo informações de contato, endereço e outros dados importantes organizados em seções."
        },
        "edit": {
          "title": "Editar Cliente",
          "content": "Clique aqui para modificar qualquer informação do cliente. Você pode atualizar detalhes de contato, status ou fazer upload de um novo logotipo."
        },
        "users": {
          "title": "Gerenciar Usuários",
          "content": "Adicione, edite ou remova usuários associados a este cliente. Controle quem tem acesso aos sistemas e dados deles."
        },
        "complete": {
          "title": "Detalhes do Cliente Explorados!",
          "content": "Agora você está familiarizado com a página de detalhes do cliente. Mantenha as informações do cliente precisas e atualizadas!"
        }
      }
    },
    "users": {
      "title": "Tour de Usuários do Cliente",
      "description": "Aprenda a gerenciar o acesso de usuários aos clientes",
      "steps": {
        "welcome": {
          "title": "Gerenciamento de Usuários do Cliente!",
          "content": "Controle quem tem acesso a este cliente e seus níveis de permissão. Vamos ver como funciona!"
        },
        "header": {
          "title": "Cabeçalho da Página de Usuários",
          "content": "Veja o nome do cliente e gerencie todos os usuários que têm acesso aos dados deste cliente."
        },
        "addButton": {
          "title": "Adicionar Acesso de Usuário",
          "content": "Clique aqui para conceder acesso de um usuário a este cliente. Você pode selecionar dos usuários disponíveis e definir seu nível de acesso."
        },
        "table": {
          "title": "Tabela de Usuários",
          "content": "Veja todos os usuários que têm acesso a este cliente, seus papéis e níveis de acesso atuais. Você pode modificar permissões ou remover acesso daqui."
        },
        "accessLevel": {
          "title": "Níveis de Acesso",
          "content": "Altere os níveis de acesso do usuário: Somente Visualização (somente leitura), Edição (criar e modificar dados) ou Admin (acesso completo incluindo gerenciamento de usuários)."
        },
        "complete": {
          "title": "Gerenciamento de Usuários Concluído!",
          "content": "Agora você sabe como controlar o acesso de usuários aos clientes. Mantenha as permissões atualizadas para segurança!"
        }
      }
    },
    "firstSetup": {
      "title": "Tour de Configuração do Primeiro Cliente",
      "description": "Bem-vindo! Vamos adicionar seu primeiro cliente para começar",
      "steps": {
        "welcome": {
          "title": "Bem-vindo ao LINCE!",
          "content": "Ótimo ter você aqui! Antes de começar a gerenciar sistemas de tratamento de água, você precisa adicionar seu primeiro cliente. Este tour rápido vai guiá-lo pelo processo."
        },
        "header": {
          "title": "Começando",
          "content": "Esta página ajuda você a adicionar seu primeiro cliente. Um cliente representa uma organização ou local para o qual você gerenciará sistemas de tratamento de água."
        },
        "form": {
          "title": "Formulário de Informações do Cliente",
          "content": "Preencha este formulário simples com as informações básicas do seu cliente. Somente o nome do cliente é obrigatório para começar - você sempre pode adicionar mais detalhes depois."
        },
        "requiredFields": {
          "title": "Nome do Cliente (Obrigatório)",
          "content": "Digite o nome do seu cliente. Este é o único campo obrigatório. O nome do cliente aparecerá em todo o sistema quando você estiver gerenciando os sistemas de tratamento de água dele."
        },
        "contactFields": {
          "title": "Informações de Contato (Opcional)",
          "content": "Adicione detalhes de contato como endereço, pessoa de contato, telefone e e-mail. Estes são opcionais, mas úteis para manter todas as informações do cliente em um só lugar."
        },
        "submit": {
          "title": "Adicionar Cliente e Continuar",
          "content": "Depois de digitar pelo menos o nome do cliente, clique aqui para salvar seu primeiro cliente e continuar para o painel. Você poderá adicionar mais clientes depois!"
        },
        "complete": {
          "title": "Tudo Pronto!",
          "content": "Perfeito! Agora você sabe como adicionar seu primeiro cliente. Depois de enviar este formulário, você será levado ao painel onde poderá começar a gerenciar sistemas de tratamento de água."
        }
      }
    }
  }
}
