{
  "common": {
    "skip": "Pular Tour",
    "next": "Próximo",
    "back": "Voltar",
    "finish": "Concluir",
    "close": "Fechar",
    "startTour": "Iniciar Tour",
    "resumeTour": "Retomar Tour",
    "tourCompleted": "Tour Concluído!",
    "restartTour": "Reiniciar Tour"
  },
  "categories": {
    "operations": "Operações",
    "management": "Gestão",
    "administration": "Administração"
  },
  "dailyLogs": {
    "list": {
      "title": "Tour de Registros Diários",
      "description": "Aprenda a gerenciar e rastrear registros diários de tratamento de água",
      "steps": {
        "welcome": {
          "title": "Bem-vindo aos Registros Diários!",
          "content": "Os registros diários são onde você registra medições de campo e resultados de laboratório para seus sistemas de tratamento de água. Vamos explorar como gerenciá-los de forma eficaz!"
        },
        "header": {
          "title": "Página de Registros Diários",
          "content": "Esta página mostra todos os seus registros diários - tanto medições de campo quanto análises de laboratório. Você pode visualizar, filtrar e exportar seus registros daqui."
        },
        "viewMode": {
          "title": "Alternar Modo de Visualização",
          "content": "Alterne entre visualização em tabela (lista detalhada) e visualização em gráfico (gráficos visuais) para analisar seus dados de diferentes maneiras. Perfeito para identificar tendências!"
        },
        "export": {
          "title": "Exportar Seus Dados",
          "content": "Exporte seus registros diários para formato PDF, HTML ou CSV para relatórios, documentação de conformidade ou análise offline."
        },
        "newLog": {
          "title": "Criar Novo Registro",
          "content": "Clique aqui para registrar um novo registro diário - seja medições de campo feitas no local ou resultados de análise de laboratório."
        },
        "filters": {
          "title": "Filtrar Seus Registros",
          "content": "Use filtros para encontrar registros específicos por sistema, etapa, tipo de registro (campo/laboratório) ou intervalo de datas. Ótimo para análise focada!"
        },
        "table": {
          "title": "Tabela de Registros Diários",
          "content": "Veja todos os seus registros com detalhes principais: tipo, data, sistema, período, laboratório, registrado por e número de entradas. Alertas mostram se algum parâmetro está fora da faixa. Clique em qualquer linha para ver detalhes completos."
        },
        "pagination": {
          "title": "Navegação",
          "content": "Navegue por várias páginas de registros e ajuste quantos registros são mostrados por página."
        },
        "complete": {
          "title": "Registros Diários Dominados!",
          "content": "Agora você sabe como gerenciar registros diários de forma eficaz. Comece a registrar seus dados de tratamento de água para acompanhar o desempenho do sistema!"
        }
      }
    },
    "new": {
      "title": "Tour de Criar Registro Diário",
      "description": "Aprenda a registrar medições de campo e resultados de laboratório",
      "steps": {
        "welcome": {
          "title": "Registre um Novo Registro Diário!",
          "content": "Este formulário ajuda você a registrar dados diários de tratamento de água - seja medições de campo feitas no local ou resultados de análise de laboratório. Vamos percorrê-lo!"
        },
        "header": {
          "title": "Formulário de Novo Registro",
          "content": "Esta página permite criar uma nova entrada de registro diário. Você pode registrar medições de campo ou análise de laboratório para qualquer um dos seus sistemas."
        },
        "actionButtons": {
          "title": "Salvar ou Cancelar",
          "content": "Use estes botões para salvar seu registro diário quando terminar, ou cancelar para voltar sem salvar as alterações."
        },
        "recordType": {
          "title": "Tipo de Registro",
          "content": "Escolha entre Registro de Campo (medições feitas no local) ou Registro de Laboratório (análise realizada em laboratório). Isso determina quais campos você precisará preencher."
        },
        "systemSelection": {
          "title": "Selecionar Sistema",
          "content": "Escolha para qual sistema de tratamento de água você está registrando dados. Se o sistema tiver etapas, você pode opcionalmente selecionar uma etapa específica."
        },
        "datePeriod": {
          "title": "Data e Período",
          "content": "Digite a data da medição e opcionalmente especifique o período (manhã, tarde, etc.). Você também pode adicionar a hora exata se necessário."
        },
        "monitoringValues": {
          "title": "Digite as Medições",
          "content": "Registre valores para cada ponto de monitoramento. Você verá o nome do parâmetro, unidade e faixa aceitável. Digite pelo menos um valor para salvar o registro. Valores fora da faixa dispararão alertas!"
        },
        "complete": {
          "title": "Pronto para Registrar!",
          "content": "Agora você sabe como criar registros diários. Preencha as informações obrigatórias e valores de monitoramento, depois clique em Salvar para registrar seus dados!"
        }
      }
    },
    "detail": {
      "title": "Tour de Detalhes do Registro Diário",
      "description": "Aprenda a revisar entradas de registros diários e valores de monitoramento",
      "steps": {
        "welcome": {
          "title": "Visualizar Detalhes do Registro Diário!",
          "content": "Esta página mostra detalhes completos de uma entrada de registro diário, incluindo todos os valores de monitoramento e seu status. Vamos explorar quais informações estão disponíveis!"
        },
        "header": {
          "title": "Visão Geral do Registro",
          "content": "Veja o tipo de registro (campo/laboratório), data e nome do sistema rapidamente. Isso fornece contexto rápido sobre o registro que você está visualizando."
        },
        "recordInfo": {
          "title": "Informações do Registro",
          "content": "Visualize todos os detalhes sobre este registro: tipo de registro, sistema, data, período, hora e quem registrou. Para registros de laboratório, você também verá o nome do laboratório e detalhes da coleta. O emblema de status alerta se algum parâmetro está fora da faixa."
        },
        "monitoringEntries": {
          "title": "Valores de Monitoramento",
          "content": "Veja todas as medições registradas com seu ponto de monitoramento, valor, faixa esperada e status. Valores fora da faixa são destacados em vermelho com um emblema de perigo, facilitando a identificação de problemas que precisam de atenção!"
        },
        "complete": {
          "title": "Detalhes Revisados!",
          "content": "Agora você sabe como revisar detalhes de registros diários. Use esta página para analisar dados registrados, verificar valores fora da faixa e garantir que o desempenho do sistema está no caminho certo!"
        }
      }
    }
  },
  "incidents": {
    "list": {
      "title": "Tour de Incidentes",
      "description": "Aprenda a gerenciar e rastrear incidentes em seus sistemas de tratamento de água",
      "steps": {
        "welcome": {
          "title": "Bem-vindo aos Incidentes!",
          "content": "Os incidentes ajudam você a rastrear e resolver problemas que ocorrem em seus sistemas de tratamento de água. Vamos explorar como gerenciá-los de forma eficaz!"
        },
        "header": {
          "title": "Página de Incidentes",
          "content": "Esta página mostra todos os incidentes reportados com sua prioridade, status e atribuições. Você pode visualizar, filtrar e exportar relatórios de incidentes daqui."
        },
        "viewMode": {
          "title": "Alternar Modo de Visualização",
          "content": "Alterne entre visualização em tabela (lista detalhada) e visualização em gráfico (gráficos visuais) para analisar incidentes de diferentes maneiras. Gráficos ajudam a identificar padrões e tendências!"
        },
        "export": {
          "title": "Exportar Seus Dados",
          "content": "Exporte relatórios de incidentes para formato PDF, HTML ou CSV para documentação, conformidade ou análise offline."
        },
        "reportButton": {
          "title": "Reportar Novo Incidente",
          "content": "Clique aqui para reportar um novo incidente. Você pode documentar problemas, definir níveis de prioridade e atribuí-los a membros da equipe para resolução."
        },
        "filters": {
          "title": "Filtrar Incidentes",
          "content": "Use filtros para encontrar incidentes específicos por sistema, etapa, status, prioridade ou intervalo de datas. Ótimo para rastrear o progresso da resolução!"
        },
        "table": {
          "title": "Tabela de Incidentes",
          "content": "Veja todos os incidentes com detalhes principais: título, sistema, prioridade, status, reporter e data de criação. Emblemas coloridos facilitam a identificação de problemas críticos. Clique em qualquer linha para ver detalhes completos."
        },
        "complete": {
          "title": "Incidentes Dominados!",
          "content": "Agora você sabe como gerenciar incidentes de forma eficaz. Comece a rastrear e resolver problemas para manter o desempenho ideal do sistema!"
        }
      }
    },
    "new": {
      "title": "Tour de Reportar Incidente",
      "description": "Aprenda a reportar e documentar incidentes em seus sistemas",
      "steps": {
        "welcome": {
          "title": "Reporte um Novo Incidente!",
          "content": "Este formulário ajuda você a documentar problemas que ocorrem em seus sistemas de tratamento de água. Vamos percorrer como reportar um incidente!"
        },
        "header": {
          "title": "Formulário de Novo Incidente",
          "content": "Esta página permite reportar um novo incidente. Você pode descrever o problema, definir prioridade e atribuí-lo a membros da equipe para resolução."
        },
        "actionButtons": {
          "title": "Salvar ou Cancelar",
          "content": "Use estes botões para enviar seu relatório de incidente quando terminar, ou cancelar para voltar sem salvar as alterações."
        },
        "basicInfo": {
          "title": "Informações Básicas",
          "content": "Digite o título do incidente, selecione o sistema afetado, defina o nível de prioridade (crítico, alto, médio, baixo) e escolha o status atual. A prioridade ajuda os membros da equipe a abordar problemas críticos primeiro!"
        },
        "description": {
          "title": "Descrição do Incidente",
          "content": "Forneça uma descrição detalhada do incidente. Inclua o que aconteceu, quando ocorreu e quaisquer observações. Descrições claras ajudam com resolução mais rápida!"
        },
        "assignment": {
          "title": "Atribuição e Rastreamento",
          "content": "Opcionalmente atribua o incidente a um membro da equipe para resolução. Você também pode adicionar notas sobre etapas tomadas ou contexto adicional."
        },
        "complete": {
          "title": "Pronto para Reportar!",
          "content": "Agora você sabe como reportar incidentes. Preencha as informações obrigatórias e clique em Enviar para criar o relatório de incidente!"
        }
      }
    },
    "detail": {
      "title": "Tour de Detalhes do Incidente",
      "description": "Aprenda a revisar detalhes de incidentes e rastrear o progresso da resolução",
      "steps": {
        "welcome": {
          "title": "Visualizar Detalhes do Incidente!",
          "content": "Esta página mostra detalhes completos de um incidente, incluindo sua descrição, status, atribuição e informações de resolução. Vamos explorar o que está disponível!"
        },
        "header": {
          "title": "Visão Geral do Incidente",
          "content": "Veja o título do incidente, prioridade e status rapidamente. Emblemas coloridos ajudam você a identificar rapidamente a gravidade e o estado atual."
        },
        "incidentInfo": {
          "title": "Informações do Incidente",
          "content": "Visualize todos os detalhes sobre este incidente: sistema, prioridade, status, reporter, responsável, data de criação e descrição completa. Isso fornece contexto completo sobre o problema."
        },
        "resolution": {
          "title": "Detalhes da Resolução",
          "content": "Veja informações de resolução incluindo quando o incidente foi resolvido, quem resolveu e notas de resolução. Para incidentes abertos, você pode atualizar o status e adicionar notas de resolução aqui."
        },
        "complete": {
          "title": "Detalhes Revisados!",
          "content": "Agora você sabe como revisar detalhes de incidentes e rastrear o progresso da resolução. Use esta página para monitorar problemas e garantir que sejam abordados prontamente!"
        }
      }
    }
  },
  "inspections": {
    "list": {
      "title": "Tour de Inspeções",
      "description": "Aprenda a gerenciar e rastrear inspeções do sistema",
      "steps": {
        "welcome": {
          "title": "Bem-vindo às Inspeções!",
          "content": "As inspeções ajudam você a garantir que seus sistemas de tratamento de água estejam operando corretamente através de verificações sistemáticas. Vamos explorar como gerenciá-las!"
        },
        "header": {
          "title": "Página de Inspeções",
          "content": "Esta página mostra todas as inspeções com seu status, resultados e detalhes de conclusão. Você pode visualizar, filtrar e exportar relatórios de inspeção daqui."
        },
        "viewMode": {
          "title": "Alternar Modo de Visualização",
          "content": "Alterne entre visualização em tabela (lista detalhada) e visualização em gráfico (gráficos visuais) para analisar dados de inspeção de diferentes maneiras. Gráficos ajudam a identificar tendências de conformidade!"
        },
        "export": {
          "title": "Exportar Seus Dados",
          "content": "Exporte relatórios de inspeção para formato PDF, HTML ou CSV para documentação, registros de conformidade ou análise offline."
        },
        "newInspection": {
          "title": "Criar Nova Inspeção",
          "content": "Clique aqui para realizar uma nova inspeção. Você completará uma lista de verificação de itens para verificar se seu sistema está operando dentro das especificações."
        },
        "filters": {
          "title": "Filtrar Inspeções",
          "content": "Use filtros para encontrar inspeções específicas por sistema, etapa, status ou intervalo de datas. Ótimo para revisar histórico de conformidade!"
        },
        "table": {
          "title": "Tabela de Inspeções",
          "content": "Veja todas as inspeções com detalhes principais: data, sistema, inspetor, status e resultados dos itens (conforme/não conforme). Clique em qualquer linha para ver detalhes completos e fotos."
        },
        "complete": {
          "title": "Inspeções Dominadas!",
          "content": "Agora você sabe como gerenciar inspeções de forma eficaz. Inspeções regulares ajudam a manter a conformidade do sistema e identificar problemas cedo!"
        }
      }
    },
    "new": {
      "title": "Tour de Criar Inspeção",
      "description": "Aprenda a realizar e documentar inspeções do sistema",
      "steps": {
        "welcome": {
          "title": "Realize uma Nova Inspeção!",
          "content": "Este formulário guia você através de uma inspeção sistemática do seu sistema de tratamento de água. Vamos percorrer o processo de lista de verificação!"
        },
        "header": {
          "title": "Formulário de Nova Inspeção",
          "content": "Esta página permite criar um novo registro de inspeção. Você completará uma lista de verificação de itens para verificar a conformidade do sistema."
        },
        "actionButtons": {
          "title": "Salvar ou Cancelar",
          "content": "Use estes botões para salvar sua inspeção quando terminar, ou cancelar para voltar sem salvar as alterações."
        },
        "basicInfo": {
          "title": "Detalhes da Inspeção",
          "content": "Selecione o sistema a inspecionar e defina a data da inspeção. Se o sistema tiver etapas, você pode opcionalmente selecionar uma etapa específica para focar."
        },
        "checklistItems": {
          "title": "Itens da Lista de Verificação",
          "content": "Percorra cada item da lista de verificação e marque-o como Conforme (C), Não Conforme (NC) ou Não Aplicável (NA). Adicione observações e fotos para itens não conformes para documentar problemas."
        },
        "conclusion": {
          "title": "Conclusão da Inspeção",
          "content": "Adicione sua conclusão geral e quaisquer observações gerais sobre a inspeção. Isso fornece contexto para os resultados."
        },
        "complete": {
          "title": "Pronto para Concluir!",
          "content": "Agora você sabe como realizar inspeções. Complete todos os itens da lista de verificação e clique em Salvar para registrar sua inspeção!"
        }
      }
    },
    "detail": {
      "title": "Tour de Detalhes da Inspeção",
      "description": "Aprenda a revisar resultados e descobertas de inspeção",
      "steps": {
        "welcome": {
          "title": "Visualizar Resultados da Inspeção!",
          "content": "Esta página mostra detalhes completos de uma inspeção, incluindo todos os itens da lista de verificação, seu status, fotos e observações. Vamos explorar os resultados!"
        },
        "header": {
          "title": "Visão Geral da Inspeção",
          "content": "Veja a data da inspeção, sistema e status rapidamente. Isso fornece contexto rápido sobre a inspeção que você está revisando."
        },
        "inspectionInfo": {
          "title": "Informações da Inspeção",
          "content": "Visualize todos os detalhes sobre esta inspeção: data, sistema, etapa, inspetor, status e conclusão. Isso fornece contexto completo sobre quando e como a inspeção foi realizada."
        },
        "checklistResults": {
          "title": "Resultados da Lista de Verificação",
          "content": "Veja todos os itens da lista de verificação com seu status (Conforme/Não Conforme/NA), observações e fotos. Itens não conformes são destacados para facilitar a identificação de problemas. Clique nos itens para ver detalhes completos e fotos!"
        },
        "complete": {
          "title": "Resultados Revisados!",
          "content": "Agora você sabe como revisar detalhes de inspeção. Use esta página para verificar conformidade, rastrear itens não conformes e garantir que ações corretivas sejam tomadas!"
        }
      }
    }
  },
  "dashboard": {
    "title": "Tour do Painel",
    "description": "Aprenda a usar o painel principal e entender as métricas principais",
    "steps": {
      "welcome": {
        "title": "Bem-vindo ao LINCE!",
        "content": "Vamos fazer um tour rápido do seu painel. Você vai aprender como visualizar estatísticas, monitorar atividades recentes e acompanhar alertas. Clique em 'Próximo' para começar."
      },
      "header": {
        "title": "Cabeçalho do Painel",
        "content": "Este é o cabeçalho do seu painel mostrando a visualização atual e suas informações de usuário. Você pode ver uma mensagem de boas-vindas personalizada aqui."
      },
      "viewMode": {
        "title": "Alternar Modo de Visualização",
        "content": "Alterne entre visualização em tabela (listas detalhadas) e visualização em gráfico (gráficos visuais) para ver seus dados em diferentes formatos. Experimente clicar neste botão!"
      },
      "export": {
        "title": "Opções de Exportação",
        "content": "Exporte os dados do seu painel para formatos PDF, HTML ou CSV para relatórios e manutenção de registros. Perfeito para compartilhar com sua equipe ou manter arquivos."
      },
      "stats": {
        "title": "Visão Geral das Estatísticas",
        "content": "Estes cartões mostram as métricas principais dos seus sistemas de tratamento de água: total de sistemas, registros diários, inspeções, incidentes e alertas. Monitore tudo de relance!"
      },
      "recentActivity": {
        "title": "Atividade Recente",
        "content": "Veja seus registros diários, inspeções e incidentes mais recentes em um só lugar. Clique em qualquer item para ver mais detalhes."
      },
      "alerts": {
        "title": "Alertas Ativos",
        "content": "Alertas críticos e notificações aparecem aqui. Fique de olho em parâmetros fora da faixa, itens com estoque baixo e notificações não lidas."
      },
      "sidebar": {
        "title": "Navegação Principal",
        "content": "Use a barra lateral para navegar entre diferentes seções: Registros Diários, Inspeções, Incidentes, Sistemas, Relatórios e mais. Todas as suas ferramentas estão a apenas um clique de distância!"
      },
      "complete": {
        "title": "Tudo Pronto!",
        "content": "Ótimo trabalho! Agora você conhece o básico do painel. Explore outras seções para aprender mais, ou clique em 'Concluir' para começar a usar o LINCE."
      }
    }
  },
  "clients": {
    "list": {
      "title": "Tour de Gestão de Clientes",
      "description": "Aprenda a gerenciar seus clientes e suas informações",
      "steps": {
        "welcome": {
          "title": "Bem-vindo à Gestão de Clientes!",
          "content": "Este tour mostrará como gerenciar clientes, adicionar novos e manter o controle de todas as informações dos clientes. Vamos começar!"
        },
        "header": {
          "title": "Cabeçalho da Página de Clientes",
          "content": "Veja uma visão geral da sua seção de gestão de clientes. O cabeçalho mostra o número total de clientes que você está gerenciando."
        },
        "addButton": {
          "title": "Adicionar Novo Cliente",
          "content": "Clique aqui para adicionar um novo cliente. Você poderá inserir todas as informações, incluindo nome, detalhes de contato e endereço."
        },
        "search": {
          "title": "Buscar Clientes",
          "content": "Encontre clientes rapidamente digitando seu nome, e-mail ou número de telefone. Os resultados são atualizados conforme você digita!"
        },
        "table": {
          "title": "Tabela de Clientes",
          "content": "Visualize todos os seus clientes nesta tabela organizada. Você pode ver nome, pessoa de contato, e-mail, telefone e status atual. Clique em qualquer linha para ver detalhes completos."
        },
        "actions": {
          "title": "Ações do Cliente",
          "content": "Clique no ícone de menu para editar informações do cliente, gerenciar seus usuários ou excluir o cliente, se necessário."
        },
        "pagination": {
          "title": "Paginação",
          "content": "Navegue por várias páginas de clientes e ajuste quantos clientes são mostrados por página."
        },
        "complete": {
          "title": "Gestão de Clientes Dominada!",
          "content": "Agora você sabe como gerenciar seus clientes de forma eficaz. Experimente adicionar um novo cliente ou explorar seus detalhes!"
        }
      }
    },
    "add": {
      "title": "Tour de Adicionar Cliente",
      "description": "Guia passo a passo para adicionar um novo cliente",
      "steps": {
        "welcome": {
          "title": "Vamos Adicionar um Novo Cliente!",
          "content": "Este formulário ajudará você a registrar um novo cliente com todas as informações essenciais. Vamos orientá-lo em cada seção."
        },
        "form": {
          "title": "Formulário de Informações do Cliente",
          "content": "Preencha este formulário com os detalhes do seu cliente. Todos os campos obrigatórios estão marcados com um asterisco (*)."
        },
        "basicInfo": {
          "title": "Informações Básicas",
          "content": "Digite o nome do cliente e selecione se ele está ativo no momento. Você também pode fazer upload de um logotipo, se disponível."
        },
        "contactInfo": {
          "title": "Informações de Contato",
          "content": "Forneça detalhes de contato, incluindo nome da pessoa de contato, e-mail, telefone e endereço físico do cliente."
        },
        "submit": {
          "title": "Salvar Cliente",
          "content": "Depois de preencher todas as informações obrigatórias, clique aqui para salvar o novo cliente. Você será redirecionado para a página de detalhes do cliente."
        },
        "complete": {
          "title": "Adição de Cliente Concluída!",
          "content": "Ótimo! Agora você sabe como adicionar novos clientes. Certifique-se de manter suas informações atualizadas."
        }
      }
    },
    "detail": {
      "title": "Tour de Detalhes do Cliente",
      "description": "Explore detalhes e opções de gerenciamento do cliente",
      "steps": {
        "welcome": {
          "title": "Página de Detalhes do Cliente!",
          "content": "Aqui você pode visualizar e gerenciar todas as informações sobre este cliente. Vamos explorar o que você pode fazer."
        },
        "header": {
          "title": "Cabeçalho do Cliente",
          "content": "Veja o nome, logotipo e status do cliente rapidamente. Este cabeçalho fornece identificação rápida."
        },
        "info": {
          "title": "Informações do Cliente",
          "content": "Veja todos os detalhes do cliente, incluindo informações de contato, endereço e outros dados importantes organizados em seções."
        },
        "edit": {
          "title": "Editar Cliente",
          "content": "Clique aqui para modificar qualquer informação do cliente. Você pode atualizar detalhes de contato, status ou fazer upload de um novo logotipo."
        },
        "users": {
          "title": "Gerenciar Usuários",
          "content": "Adicione, edite ou remova usuários associados a este cliente. Controle quem tem acesso aos sistemas e dados deles."
        },
        "complete": {
          "title": "Detalhes do Cliente Explorados!",
          "content": "Agora você está familiarizado com a página de detalhes do cliente. Mantenha as informações do cliente precisas e atualizadas!"
        }
      }
    },
    "users": {
      "title": "Tour de Usuários do Cliente",
      "description": "Aprenda a gerenciar o acesso de usuários aos clientes",
      "steps": {
        "welcome": {
          "title": "Gerenciamento de Usuários do Cliente!",
          "content": "Controle quem tem acesso a este cliente e seus níveis de permissão. Vamos ver como funciona!"
        },
        "header": {
          "title": "Cabeçalho da Página de Usuários",
          "content": "Veja o nome do cliente e gerencie todos os usuários que têm acesso aos dados deste cliente."
        },
        "addButton": {
          "title": "Adicionar Acesso de Usuário",
          "content": "Clique aqui para conceder acesso de um usuário a este cliente. Você pode selecionar dos usuários disponíveis e definir seu nível de acesso."
        },
        "table": {
          "title": "Tabela de Usuários",
          "content": "Veja todos os usuários que têm acesso a este cliente, seus papéis e níveis de acesso atuais. Você pode modificar permissões ou remover acesso daqui."
        },
        "accessLevel": {
          "title": "Níveis de Acesso",
          "content": "Altere os níveis de acesso do usuário: Somente Visualização (somente leitura), Edição (criar e modificar dados) ou Admin (acesso completo incluindo gerenciamento de usuários)."
        },
        "complete": {
          "title": "Gerenciamento de Usuários Concluído!",
          "content": "Agora você sabe como controlar o acesso de usuários aos clientes. Mantenha as permissões atualizadas para segurança!"
        }
      }
    },
    "firstSetup": {
      "title": "Tour de Configuração do Primeiro Cliente",
      "description": "Bem-vindo! Vamos adicionar seu primeiro cliente para começar",
      "steps": {
        "welcome": {
          "title": "Bem-vindo ao LINCE!",
          "content": "Ótimo ter você aqui! Antes de começar a gerenciar sistemas de tratamento de água, você precisa adicionar seu primeiro cliente. Este tour rápido vai guiá-lo pelo processo."
        },
        "header": {
          "title": "Começando",
          "content": "Esta página ajuda você a adicionar seu primeiro cliente. Um cliente representa uma organização ou local para o qual você gerenciará sistemas de tratamento de água."
        },
        "form": {
          "title": "Formulário de Informações do Cliente",
          "content": "Preencha este formulário simples com as informações básicas do seu cliente. Somente o nome do cliente é obrigatório para começar - você sempre pode adicionar mais detalhes depois."
        },
        "requiredFields": {
          "title": "Nome do Cliente (Obrigatório)",
          "content": "Digite o nome do seu cliente. Este é o único campo obrigatório. O nome do cliente aparecerá em todo o sistema quando você estiver gerenciando os sistemas de tratamento de água dele."
        },
        "contactFields": {
          "title": "Informações de Contato (Opcional)",
          "content": "Adicione detalhes de contato como endereço, pessoa de contato, telefone e e-mail. Estes são opcionais, mas úteis para manter todas as informações do cliente em um só lugar."
        },
        "submit": {
          "title": "Adicionar Cliente e Continuar",
          "content": "Depois de digitar pelo menos o nome do cliente, clique aqui para salvar seu primeiro cliente e continuar para o painel. Você poderá adicionar mais clientes depois!"
        },
        "complete": {
          "title": "Tudo Pronto!",
          "content": "Perfeito! Agora você sabe como adicionar seu primeiro cliente. Depois de enviar este formulário, você será levado ao painel onde poderá começar a gerenciar sistemas de tratamento de água."
        }
      }
    }
  },
  "products": {
    "list": {
      "title": "Tour de Inventário de Produtos",
      "description": "Aprenda a gerenciar produtos químicos e inventário",
      "steps": {
        "welcome": {
          "title": "Bem-vindo ao Gerenciamento de Produtos!",
          "content": "Gerencie seu inventário de produtos químicos para tratamento de água aqui. Acompanhe níveis de estoque, defina alertas de estoque baixo e monitore o uso de produtos em todos os sistemas. Vamos explorar!"
        },
        "header": {
          "title": "Página de Produtos",
          "content": "Esta página mostra seu inventário completo de produtos. Visualize todos os produtos químicos, seus níveis de estoque atuais, fornecedores e alertas de estoque baixo."
        },
        "viewMode": {
          "title": "Alternar Modo de Visualização",
          "content": "Alterne entre visualização de tabela (lista detalhada de produtos) e visualização de gráfico (análise visual de inventário) para gerenciar seu estoque efetivamente."
        },
        "export": {
          "title": "Exportar Inventário",
          "content": "Exporte seu inventário de produtos para formato PDF, HTML ou CSV para compras, auditorias ou relatórios."
        },
        "addProduct": {
          "title": "Adicionar Novo Produto",
          "content": "Clique aqui para adicionar um novo produto químico ao seu inventário. Insira detalhes como nome, tipo, unidade, fornecedor e níveis de estoque."
        },
        "filters": {
          "title": "Filtrar Produtos",
          "content": "Filtre produtos por sistema, tipo ou mostre apenas itens com estoque baixo. Perfeito para planejamento de compras e verificações de inventário!"
        },
        "table": {
          "title": "Tabela de Produtos",
          "content": "Visualize todos os produtos com estoque atual, níveis de alerta mínimos, status (em estoque/estoque baixo) e informações do fornecedor. Clique em qualquer linha para ver o histórico detalhado de uso e gerenciar o estoque."
        },
        "complete": {
          "title": "Gerenciamento de Inventário Pronto!",
          "content": "Agora você sabe como gerenciar seu inventário de produtos químicos. Acompanhe os níveis de estoque para garantir que seu tratamento de água nunca fique sem produtos essenciais!"
        }
      }
    },
    "form": {
      "title": "Tour de Adicionar/Editar Produto",
      "description": "Aprenda a adicionar e configurar produtos em seu inventário",
      "steps": {
        "welcome": {
          "title": "Adicionando um Novo Produto",
          "content": "Vamos percorrer a adição de um novo produto químico ao seu inventário. Você configurará todos os detalhes necessários para um gerenciamento eficaz de estoque."
        },
        "name": {
          "title": "Nome do Produto",
          "content": "Digite o nome do produto (ex: 'Hipoclorito de Sódio', 'PAC', 'Cal'). Use nomes claros e consistentes para fácil identificação."
        },
        "type": {
          "title": "Tipo de Produto",
          "content": "Selecione o tipo de produto (ex: Coagulante, Desinfetante, Corretor de pH). Isso ajuda a categorizar e filtrar produtos."
        },
        "unit": {
          "title": "Unidade de Medida",
          "content": "Escolha a unidade para medir este produto (kg, L, mL, g, etc.). Isso será usado para todo o rastreamento de estoque e registros de uso."
        },
        "stock": {
          "title": "Níveis de Estoque",
          "content": "Digite a quantidade de estoque atual e o nível de alerta mínimo. Quando o estoque cair abaixo do mínimo, você receberá avisos de estoque baixo."
        },
        "supplier": {
          "title": "Info de Fornecedor e Dosagem",
          "content": "Adicione informações do fornecedor e diretrizes de dosagem recomendadas. Isso ajuda com compras e uso adequado do produto."
        },
        "complete": {
          "title": "Produto Configurado!",
          "content": "Ótimo! Você aprendeu como adicionar produtos ao seu inventário. Preencha o formulário e salve para adicionar seu primeiro produto."
        }
      }
    },
    "detail": {
      "title": "Tour de Detalhes do Produto",
      "description": "Aprenda a gerenciar estoque e rastrear uso de produtos",
      "steps": {
        "welcome": {
          "title": "Página de Detalhes do Produto",
          "content": "Esta página mostra informações completas do produto, níveis de estoque, histórico de uso e configurações de dosagem. Vamos explorar como gerenciá-lo!"
        },
        "header": {
          "title": "Cabeçalho do Produto",
          "content": "Veja o nome e tipo do produto. Acesso rápido a todas as informações e ações de gerenciamento do produto."
        },
        "actions": {
          "title": "Ações de Gerenciamento de Estoque",
          "content": "Atualize níveis de estoque (adicionar/remover), registre uso de produto em sistemas ou exclua o produto se não for mais necessário."
        },
        "info": {
          "title": "Informações do Produto",
          "content": "Visualize estoque atual, nível de alerta mínimo, status do estoque, fornecedor, dosagem recomendada e descrição do produto. Todos os detalhes principais de uma vez!"
        },
        "history": {
          "title": "Histórico de Uso",
          "content": "Rastreie cada movimentação de estoque: quando os produtos foram usados, em quais sistemas, quantidades, quem registrou e quaisquer observações. Trilha de auditoria completa!"
        },
        "dosage": {
          "title": "Configurações de Dosagem",
          "content": "Configure cálculos automáticos de dosagem para diferentes sistemas. Defina fórmulas de dosagem baseadas em vazão, volume ou outros parâmetros."
        },
        "complete": {
          "title": "Gerenciamento de Produto Dominado!",
          "content": "Agora você sabe como gerenciar estoque de produtos e rastrear uso. Mantenha seu inventário atualizado para operações de tratamento de água sem problemas!"
        }
      }
    }
  },
  "reports": {
    "workflow": {
      "title": "Visão Geral do Módulo de Relatórios",
      "description": "Aprenda sobre o fluxo de trabalho completo de relatórios e recursos",
      "steps": {
        "welcome": {
          "title": "Bem-vindo aos Relatórios!",
          "content": "Gere relatórios abrangentes de tratamento de água com modelos, visualização de dados e insights com IA. Vamos explorar o módulo de relatórios!"
        },
        "header": {
          "title": "Página de Relatórios",
          "content": "Este é o hub central para todas as atividades de relatórios. Crie novos relatórios, gerencie modelos e visualize seu histórico de relatórios tudo em um só lugar."
        },
        "tabs": {
          "title": "Abas de Relatórios",
          "content": "Três abas poderosas: Gerador (criar relatórios), Modelos (personalizar layouts de relatórios) e Histórico (visualizar relatórios anteriores). Cada aba é projetada para tarefas específicas de relatórios."
        },
        "complete": {
          "title": "Relatórios Prontos!",
          "content": "Agora você entende o fluxo de trabalho de relatórios. Explore cada aba para dominar a geração de relatórios, gerenciamento de modelos e histórico de relatórios!"
        }
      }
    },
    "generator": {
      "title": "Tour do Gerador de Relatórios",
      "description": "Aprenda a gerar relatórios abrangentes de tratamento de água",
      "steps": {
        "welcome": {
          "title": "Gere Seu Primeiro Relatório!",
          "content": "O gerador de relatórios o orienta na criação de relatórios profissionais com dados de seus sistemas. Siga o processo passo a passo para criar seu relatório!"
        },
        "stepper": {
          "title": "Etapas de Geração de Relatório",
          "content": "Este stepper mostra seu progresso através de 5 etapas: Modelo, Período, Sistemas, Opções e Visualização. Complete cada etapa para gerar seu relatório."
        },
        "template": {
          "title": "Selecionar Modelo",
          "content": "Escolha um modelo de relatório que define a estrutura e seções do seu relatório. Você pode usar modelos padrão ou criar personalizados na aba Modelos."
        },
        "period": {
          "title": "Selecionar Período",
          "content": "Escolha o período do relatório: diário, semanal, mensal ou intervalo de datas personalizado. Isso determina quais dados serão incluídos no seu relatório."
        },
        "systems": {
          "title": "Selecionar Sistemas",
          "content": "Escolha quais sistemas de tratamento de água incluir no relatório. Você pode selecionar vários sistemas para criar relatórios abrangentes cobrindo todas as suas operações."
        },
        "options": {
          "title": "Opções de Relatório",
          "content": "Configure opções de relatório: incluir apenas alertas, adicionar fotos, gerar gráficos, selecionar pontos de monitoramento e adicionar conclusões geradas por IA com campos de assinatura."
        },
        "preview": {
          "title": "Visualizar e Editar",
          "content": "Visualize seu relatório antes de gerar o PDF final. Revise todas as seções, edite a conclusão gerada por IA e adicione informações de assinatura."
        },
        "actions": {
          "title": "Salvar e Compartilhar",
          "content": "Uma vez satisfeito com a visualização, salve no banco de dados, baixe como PDF/Word ou envie por e-mail. Seu relatório também aparecerá na aba Histórico."
        },
        "complete": {
          "title": "Geração de Relatórios Dominada!",
          "content": "Agora você sabe como gerar relatórios profissionais de tratamento de água. Pratique criando relatórios para diferentes períodos e sistemas!"
        }
      }
    },
    "templates": {
      "title": "Tour de Modelos de Relatórios",
      "description": "Aprenda a criar e gerenciar modelos de relatórios personalizados",
      "steps": {
        "welcome": {
          "title": "Personalize Seus Relatórios!",
          "content": "Modelos de relatórios definem a estrutura, seções e marca dos seus relatórios. Crie modelos personalizados para atender às necessidades da sua organização!"
        },
        "create": {
          "title": "Criar Novo Modelo",
          "content": "Clique aqui para criar um novo modelo de relatório. Você definirá seções, cabeçalhos, rodapés e personalizará a aparência dos seus relatórios."
        },
        "grid": {
          "title": "Grade de Modelos",
          "content": "Visualize todos os seus modelos de relatórios. Cada cartão mostra o nome do modelo, descrição, seções e se está definido como padrão."
        },
        "card": {
          "title": "Ações de Modelo",
          "content": "Edite modelos para personalizar seções, duplique modelos para criar variações, defina modelo padrão para acesso rápido ou exclua modelos não utilizados."
        },
        "complete": {
          "title": "Gerenciamento de Modelos Dominado!",
          "content": "Agora você sabe como gerenciar modelos de relatórios. Crie modelos adaptados a diferentes tipos de relatórios e requisitos regulatórios!"
        }
      }
    },
    "history": {
      "title": "Tour do Histórico de Relatórios",
      "description": "Aprenda a visualizar e gerenciar relatórios gerados anteriormente",
      "steps": {
        "welcome": {
          "title": "Acesse Seu Arquivo de Relatórios!",
          "content": "O histórico de relatórios mostra todos os relatórios gerados anteriormente. Baixe, visualize ou exclua relatórios antigos conforme necessário para conformidade e manutenção de registros."
        },
        "filters": {
          "title": "Filtrar Relatórios",
          "content": "Filtre relatórios por intervalo de datas para encontrar rapidamente relatórios específicos. Perfeito para preparação de auditoria ou revisão de dados históricos!"
        },
        "refresh": {
          "title": "Atualizar Lista",
          "content": "Clique em atualizar para atualizar a lista de relatórios e ver relatórios recém-gerados. A lista atualiza automaticamente, mas a atualização manual garante os dados mais recentes."
        },
        "table": {
          "title": "Tabela de Relatórios",
          "content": "Visualize todos os relatórios gerados com detalhes: nome, período, sistemas cobertos, data de geração, criador e disponibilidade de PDF. Clique em qualquer linha ou use o menu para baixar PDF/Word ou excluir."
        },
        "complete": {
          "title": "Gerenciamento de Histórico Dominado!",
          "content": "Agora você sabe como acessar e gerenciar seu arquivo de relatórios. Mantenha registros organizados para conformidade e análise histórica!"
        }
      }
    }
  },
  "systems": {
    "list": {
      "title": "Tour de Gerenciamento de Sistemas",
      "description": "Aprenda a gerenciar sistemas de tratamento de água",
      "steps": {
        "welcome": {
          "title": "Bem-vindo aos Sistemas!",
          "content": "Gerencie seus sistemas de tratamento de água aqui. Defina sistemas, configure pontos de monitoramento, crie listas de verificação de inspeção e acompanhe o status do sistema. Vamos explorar!"
        },
        "header": {
          "title": "Página de Sistemas",
          "content": "Esta página mostra todos os seus sistemas e estágios de tratamento de água. Sistemas são as principais unidades de tratamento, e estágios representam seções específicas dentro de um sistema."
        },
        "viewMode": {
          "title": "Alternar Modo de Visualização",
          "content": "Alterne entre visualização de tabela (lista detalhada de sistemas) e visualização de gráfico (análise visual de sistemas) para gerenciar sua infraestrutura efetivamente."
        },
        "export": {
          "title": "Exportar Sistemas",
          "content": "Exporte sua lista de sistemas para formato PDF, HTML ou CSV para documentação, relatórios ou referência offline."
        },
        "addSystem": {
          "title": "Adicionar Novo Sistema",
          "content": "Clique aqui para adicionar um novo sistema ou estágio de tratamento de água. Insira detalhes como nome, localização, tipo, capacidade e status."
        },
        "table": {
          "title": "Tabela de Sistemas",
          "content": "Visualize todos os seus sistemas e estágios com detalhes: nome, localização, tipo, status e data de criação. Clique em qualquer linha para ver detalhes completos do sistema, pontos de monitoramento e listas de verificação."
        },
        "complete": {
          "title": "Gerenciamento de Sistemas Pronto!",
          "content": "Agora você sabe como gerenciar sistemas de tratamento de água. Adicione sistemas, configure monitoramento e acompanhe o status operacional!"
        }
      }
    },
    "detail": {
      "title": "Tour de Detalhes do Sistema",
      "description": "Aprenda sobre informações do sistema e opções de gerenciamento",
      "steps": {
        "welcome": {
          "title": "Página de Detalhes do Sistema",
          "content": "Esta página mostra informações completas do sistema, configuração de monitoramento, listas de verificação de inspeção e documentação fotográfica. Vamos explorar!"
        },
        "header": {
          "title": "Cabeçalho do Sistema",
          "content": "Veja o nome do sistema, tipo e status atual. Acesso rápido a todas as informações e recursos de gerenciamento do sistema."
        },
        "actions": {
          "title": "Ações do Sistema",
          "content": "Edite detalhes do sistema, exclua o sistema (com verificações de segurança para registros relacionados) ou navegue de volta para a lista de sistemas."
        },
        "info": {
          "title": "Informações do Sistema",
          "content": "Visualize detalhes completos do sistema: localização, tipo, capacidade, horário de operação, data de instalação, status, pessoa responsável, descrição e sistema pai (se for um estágio)."
        },
        "photos": {
          "title": "Galeria de Fotos",
          "content": "Visualize fotos do sistema para documentação e referência. Carregue novas fotos para manter registros visuais da sua infraestrutura."
        },
        "complete": {
          "title": "Detalhes do Sistema Dominados!",
          "content": "Agora você entende os detalhes do sistema. Continue a aprender sobre pontos de monitoramento e listas de verificação para gerenciamento completo do sistema!"
        }
      }
    },
    "monitoringPoints": {
      "title": "Tour de Pontos de Monitoramento",
      "description": "Aprenda a configurar pontos de monitoramento para registros diários",
      "steps": {
        "welcome": {
          "title": "Configuração de Pontos de Monitoramento",
          "content": "Pontos de monitoramento definem os parâmetros que você acompanha nos registros diários. Configure pontos para pH, cloro, turbidez, vazão e outras métricas de qualidade da água!"
        },
        "section": {
          "title": "Seção de Pontos de Monitoramento",
          "content": "Esta seção mostra todos os pontos de monitoramento configurados para este sistema. Cada ponto está vinculado a um parâmetro (o que você mede) e unidade (como você mede)."
        },
        "add": {
          "title": "Adicionar Ponto de Monitoramento",
          "content": "Clique aqui para adicionar um novo ponto de monitoramento. Selecione o parâmetro, unidade, defina faixas normais (mín/máx) e configure limites de alerta para valores fora da faixa."
        },
        "table": {
          "title": "Tabela de Pontos de Monitoramento",
          "content": "Visualize todos os pontos de monitoramento com parâmetro, unidade, faixas normais, limites de alerta e ações. Edite pontos para ajustar faixas ou exclua pontos não utilizados."
        },
        "complete": {
          "title": "Configuração de Monitoramento Completa!",
          "content": "Agora você sabe como configurar pontos de monitoramento. Esses pontos aparecerão nos registros diários para entrada e acompanhamento de dados!"
        }
      }
    },
    "checklist": {
      "title": "Tour de Lista de Verificação de Inspeção",
      "description": "Aprenda a criar itens de lista de verificação de inspeção",
      "steps": {
        "welcome": {
          "title": "Configuração de Lista de Verificação de Inspeção",
          "content": "Listas de verificação de inspeção definem os itens que os operadores verificam durante as inspeções. Crie listas de verificação abrangentes para verificações de equipamentos, verificação de segurança e itens de conformidade!"
        },
        "section": {
          "title": "Seção de Lista de Verificação",
          "content": "Esta seção mostra todos os itens de lista de verificação configurados para este sistema. Cada item aparecerá em formulários de inspeção para os operadores marcarem como Conforme (OK) ou Não Conforme (Não OK)."
        },
        "add": {
          "title": "Adicionar Item de Lista de Verificação",
          "content": "Clique aqui para adicionar um novo item de lista de verificação. Insira a descrição do item e defina a ordem de exibição. Os itens aparecem nas inspeções na ordem que você define."
        },
        "table": {
          "title": "Tabela de Itens de Lista de Verificação",
          "content": "Visualize todos os itens de lista de verificação com descrições e ordem. Edite itens para alterar o texto ou reordená-los, ou exclua itens que não são mais necessários."
        },
        "complete": {
          "title": "Configuração de Lista de Verificação Completa!",
          "content": "Agora você sabe como criar listas de verificação de inspeção. Esses itens guiarão os operadores através de inspeções sistemáticas!"
        }
      }
    }
  },
  "notifications": {
    "title": "Tour de Notificações",
    "description": "Aprenda a gerenciar e criar notificações do sistema",
    "steps": {
      "welcome": {
        "title": "Bem-vindo às Notificações!",
        "content": "Mantenha-se informado com alertas do sistema, notificações de incidentes, avisos de estoque e mensagens personalizadas. Aprenda a gerenciar suas notificações efetivamente!"
      },
      "header": {
        "title": "Página de Notificações",
        "content": "Esta página mostra todas as suas notificações com contagem de não lidas. Fique por dentro de alertas importantes, incidentes, avisos de estoque baixo e atualizações do sistema."
      },
      "export": {
        "title": "Exportar Notificações",
        "content": "Exporte seu histórico de notificações para formato PDF, HTML ou CSV para manutenção de registros, auditorias ou revisão offline."
      },
      "create": {
        "title": "Criar Notificação Personalizada",
        "content": "Administradores e gerentes podem criar notificações personalizadas para enviar mensagens a todos os usuários, funções específicas ou usuários individuais. Perfeito para anúncios e atualizações importantes!"
      },
      "tabs": {
        "title": "Abas de Notificações",
        "content": "Alterne entre 'Minhas Notificações' (mensagens que você recebeu) e 'Todas as Notificações' (visão de administrador de todas as notificações do sistema com estatísticas de entrega)."
      },
      "myNotifications": {
        "title": "Lista de Minhas Notificações",
        "content": "Visualize todas as suas notificações com indicadores de prioridade, status de lida/não lida e ações rápidas. Clique em notificações relacionadas a incidentes, registros diários ou produtos para ir à página relevante."
      },
      "actions": {
        "title": "Ações de Notificações",
        "content": "Marque todas como lidas para limpar indicadores de não lidas, ou limpe todas as notificações para removê-las da sua lista. Mantenha seu centro de notificações organizado!"
      },
      "complete": {
        "title": "Notificações Dominadas!",
        "content": "Agora você sabe como gerenciar notificações e manter-se informado sobre eventos do sistema. Nunca perca alertas ou atualizações importantes!"
      }
    }
  },
  "profile": {
    "title": "Tour do Perfil",
    "description": "Aprenda a gerenciar seu perfil pessoal e configurações de segurança",
    "steps": {
      "welcome": {
        "title": "Bem-vindo ao Seu Perfil!",
        "content": "Sua página de perfil permite gerenciar suas informações pessoais, atualizar seu avatar e alterar sua senha. Mantenha sua conta segura e atualizada!"
      },
      "header": {
        "title": "Página do Perfil",
        "content": "Esta página contém todas as configurações da sua conta divididas em duas seções: informações do perfil e gerenciamento de senha."
      },
      "profileInfo": {
        "title": "Cartão de Informações do Perfil",
        "content": "Visualize e edite seus detalhes pessoais incluindo nome, e-mail, telefone, função e status da conta. Suas informações de perfil são visíveis para outros usuários no sistema."
      },
      "avatar": {
        "title": "Upload de Avatar",
        "content": "Clique no ícone da câmera para fazer upload de uma foto de perfil. Suporta formatos JPG, PNG, GIF e WebP de até 10MB. Seu avatar aparece em todo o sistema!"
      },
      "details": {
        "title": "Detalhes da Conta",
        "content": "Visualize seu e-mail, telefone, status da conta, horário do último login e data de cadastro. Essas informações ajudam você a rastrear a atividade e o status da sua conta."
      },
      "editButton": {
        "title": "Editar Perfil",
        "content": "Clique neste botão para editar seu nome, e-mail e número de telefone. Certifique-se de que suas informações de contato estejam atualizadas para notificações e comunicação do sistema!"
      },
      "password": {
        "title": "Seção de Alteração de Senha",
        "content": "Altere sua senha regularmente para manter sua conta segura. Você precisará da sua senha atual e deve confirmar a nova senha. Mínimo de 6 caracteres necessários."
      },
      "complete": {
        "title": "Gerenciamento de Perfil Completo!",
        "content": "Agora você sabe como gerenciar suas informações de perfil e configurações de segurança. Mantenha seu perfil atualizado e sua senha forte!"
      }
    }
  },
  "library": {
    "list": {
      "title": "Tour da Biblioteca de Documentos",
      "description": "Aprenda a gerenciar e organizar sua biblioteca de documentos",
      "steps": {
        "welcome": {
          "title": "Bem-vindo à Biblioteca de Documentos!",
          "content": "Armazene e gerencie todos os seus documentos de tratamento de água em um só lugar - manuais, POPs, fichas técnicas, relatórios e muito mais. Vamos explorar como organizar sua biblioteca!"
        },
        "header": {
          "title": "Página da Biblioteca",
          "content": "Esta página é seu repositório central de documentos. Faça upload, pesquise, filtre e acesse todos os documentos relacionados aos seus sistemas de tratamento de água."
        },
        "upload": {
          "title": "Fazer Upload de Documentos",
          "content": "Clique aqui para fazer upload de novos documentos. Você pode adicionar manuais, POPs, fichas técnicas, relatórios e vinculá-los a sistemas específicos para fácil organização."
        },
        "search": {
          "title": "Pesquisar e Filtrar",
          "content": "Use a barra de pesquisa para encontrar documentos por nome e filtre por categoria (manual, POP, ficha técnica, relatório) para localizar rapidamente o que você precisa."
        },
        "table": {
          "title": "Tabela de Documentos",
          "content": "Visualize todos os seus documentos com detalhes como categoria, sistema relacionado, tipo de arquivo, versão e última atualização. Clique em qualquer linha para ver detalhes completos e baixar."
        },
        "complete": {
          "title": "Gerenciamento de Biblioteca Dominado!",
          "content": "Agora você sabe como gerenciar sua biblioteca de documentos. Mantenha seus documentos organizados e facilmente acessíveis para sua equipe!"
        }
      }
    },
    "upload": {
      "title": "Tour de Upload de Documentos",
      "description": "Aprenda a fazer upload e organizar novos documentos",
      "steps": {
        "welcome": {
          "title": "Fazer Upload de um Novo Documento!",
          "content": "Siga estes passos para fazer upload e categorizar adequadamente seus documentos para fácil recuperação posterior."
        },
        "title": {
          "title": "Título do Documento",
          "content": "Digite um título claro e descritivo para o documento. Isso ajuda sua equipe a identificar rapidamente o conteúdo do documento."
        },
        "category": {
          "title": "Selecionar Categoria",
          "content": "Escolha o tipo de documento: Manual (guias de equipamento), POP (procedimentos padrão), Ficha Técnica (especificações técnicas), Relatório (resultados de análise) ou Outro (categoria personalizada)."
        },
        "system": {
          "title": "Vincular ao Sistema",
          "content": "Opcionalmente vincule este documento a um sistema específico de tratamento de água. Isso facilita encontrar documentação relacionada ao sistema. Você também pode selecionar uma etapa específica se necessário."
        },
        "description": {
          "title": "Adicionar Descrição",
          "content": "Forneça uma breve descrição do conteúdo do documento. Isso ajuda os membros da equipe a entender o que há dentro antes de baixar."
        },
        "file": {
          "title": "Fazer Upload do Arquivo",
          "content": "Selecione o arquivo para upload. Suporta PDF, documentos Office (Word, Excel, PowerPoint) e imagens (JPG, PNG). O sistema rastreia versões automaticamente."
        },
        "complete": {
          "title": "Processo de Upload Completo!",
          "content": "Agora você sabe como fazer upload e organizar documentos. Mantenha sua biblioteca atualizada com os manuais, procedimentos e relatórios mais recentes!"
        }
      }
    }
  },
  "settings": {
    "overview": {
      "title": "Tour de Visão Geral das Configurações",
      "description": "Aprenda sobre configuração do sistema e configurações de administração",
      "steps": {
        "welcome": {
          "title": "Bem-vindo às Configurações!",
          "content": "Configurações é seu centro de controle para configurar parâmetros, unidades, tipos de sistemas, tipos de produtos e mais. Vamos explorar as opções de configuração disponíveis!"
        },
        "header": {
          "title": "Página de Configurações",
          "content": "Esta página contém todas as opções de configuração do sistema. Apenas administradores podem acessar e modificar essas configurações críticas."
        },
        "tabs": {
          "title": "Abas de Configuração",
          "content": "As configurações são organizadas em abas: Parâmetros (métricas de qualidade da água), Unidades (unidades de medida), Tipos de Sistema (categorias de equipamento), Tipos de Produto (classificações químicas) e Clientes (apenas provedor de serviços)."
        },
        "complete": {
          "title": "Visão Geral das Configurações Completa!",
          "content": "Agora você entende as opções de configuração disponíveis. Use os tours dedicados para cada aba para aprender sobre configurações específicas!"
        }
      }
    },
    "parameters": {
      "title": "Tour de Configurações de Parâmetros",
      "description": "Aprenda a configurar parâmetros de qualidade da água",
      "steps": {
        "welcome": {
          "title": "Bem-vindo às Configurações de Parâmetros!",
          "content": "Parâmetros de qualidade da água são as métricas que você mede em registros diários e análises laboratoriais. Defina parâmetros personalizados específicos para seus processos de tratamento de água!"
        },
        "section": {
          "title": "Configuração de Parâmetros",
          "content": "Esta seção mostra todos os parâmetros de qualidade da água configurados como pH, turbidez, níveis de cloro, dureza e mais. Cada parâmetro pode ter faixas aceitáveis personalizadas."
        },
        "add": {
          "title": "Adicionar Novo Parâmetro",
          "content": "Clique aqui para criar um novo parâmetro de qualidade da água. Especifique o nome, unidade de medida, faixa aceitável (mín/máx) e se é crítico para alertas."
        },
        "table": {
          "title": "Tabela de Parâmetros",
          "content": "Visualize todos os parâmetros com suas unidades, faixas aceitáveis e status. Edite parâmetros para ajustar faixas ou exclua os não utilizados. Mudanças se aplicam a todos os registros diários futuros."
        },
        "complete": {
          "title": "Configuração de Parâmetros Dominada!",
          "content": "Agora você pode configurar parâmetros de qualidade da água para corresponder aos seus requisitos específicos de monitoramento. Mantenha os parâmetros atualizados com os padrões regulatórios!"
        }
      }
    },
    "units": {
      "title": "Tour de Configurações de Unidades",
      "description": "Aprenda a configurar unidades de medida",
      "steps": {
        "welcome": {
          "title": "Bem-vindo às Configurações de Unidades!",
          "content": "Unidades de medida definem como você quantifica parâmetros de qualidade da água, dosagens químicas e capacidades do sistema. Padronize unidades em toda a sua organização!"
        },
        "section": {
          "title": "Configuração de Unidades",
          "content": "Esta seção mostra todas as unidades de medida configuradas como mg/L, ppm, NTU, unidades de pH, °C e mais. Unidades são vinculadas a parâmetros e produtos."
        },
        "add": {
          "title": "Adicionar Nova Unidade",
          "content": "Clique aqui para criar uma nova unidade de medida. Especifique o símbolo da unidade, nome completo e descrição opcional. Unidades comuns incluem concentração, temperatura e unidades de taxa de fluxo."
        },
        "table": {
          "title": "Tabela de Unidades",
          "content": "Visualize todas as unidades com seus símbolos e descrições. Edite unidades para atualizar nomes ou exclua as não utilizadas. Cuidado - unidades em uso por parâmetros não podem ser excluídas."
        },
        "complete": {
          "title": "Configuração de Unidades Dominada!",
          "content": "Agora você pode gerenciar unidades de medida para garantir dados consistentes em todo o seu sistema de monitoramento de tratamento de água!"
        }
      }
    },
    "systemTypes": {
      "title": "Tour de Configurações de Tipos de Sistema",
      "description": "Aprenda a configurar tipos de sistemas de tratamento de água",
      "steps": {
        "welcome": {
          "title": "Bem-vindo às Configurações de Tipos de Sistema!",
          "content": "Tipos de sistema categorizam seus equipamentos de tratamento de água como sistemas de filtração, sistemas de cloração, sistemas de amaciamento e mais. Organize sistemas por tipo para melhor gerenciamento!"
        },
        "section": {
          "title": "Configuração de Tipos de Sistema",
          "content": "Esta seção mostra todos os tipos de sistema configurados. Cada tipo pode ter parâmetros específicos e requisitos de monitoramento. Tipos comuns incluem sistemas de OI, sistemas UV e sistemas de dosagem química."
        },
        "add": {
          "title": "Adicionar Novo Tipo de Sistema",
          "content": "Clique aqui para criar um novo tipo de sistema. Defina o nome do tipo, descrição e opcionalmente vincule parâmetros específicos que se aplicam a este tipo de sistema."
        },
        "table": {
          "title": "Tabela de Tipos de Sistema",
          "content": "Visualize todos os tipos de sistema com suas descrições e contagem de uso. Edite tipos para atualizar definições ou exclua os não utilizados. Tipos em uso por sistemas existentes não podem ser excluídos."
        },
        "complete": {
          "title": "Configuração de Tipos de Sistema Dominada!",
          "content": "Agora você pode organizar seus equipamentos de tratamento de água em categorias lógicas para melhor gerenciamento de sistemas e relatórios!"
        }
      }
    },
    "productTypes": {
      "title": "Tour de Configurações de Tipos de Produto",
      "description": "Aprenda a configurar tipos de produtos químicos",
      "steps": {
        "welcome": {
          "title": "Bem-vindo às Configurações de Tipos de Produto!",
          "content": "Tipos de produto categorizam seus produtos químicos de tratamento de água como coagulantes, desinfetantes, ajustadores de pH e mais. Organize o inventário por tipo para melhor rastreamento!"
        },
        "section": {
          "title": "Configuração de Tipos de Produto",
          "content": "Esta seção mostra todos os tipos de produto configurados. Tipos comuns incluem compostos de cloro, polímeros, ácidos, bases e produtos químicos especiais. Cada tipo ajuda a organizar o inventário."
        },
        "add": {
          "title": "Adicionar Novo Tipo de Produto",
          "content": "Clique aqui para criar um novo tipo de produto. Defina o nome do tipo, categoria (coagulante, desinfetante, etc.) e informações opcionais de segurança para manuseio."
        },
        "table": {
          "title": "Tabela de Tipos de Produto",
          "content": "Visualize todos os tipos de produto com suas categorias e contagem de uso. Edite tipos para atualizar classificações ou exclua os não utilizados. Tipos em uso por produtos no inventário não podem ser excluídos."
        },
        "complete": {
          "title": "Configuração de Tipos de Produto Dominada!",
          "content": "Agora você pode organizar seus produtos químicos em categorias para melhor gerenciamento de inventário, pedidos e conformidade de segurança!"
        }
      }
    },
    "clients": {
      "title": "Tour de Configurações de Clientes",
      "description": "Aprenda a gerenciar contas de clientes (apenas provedores de serviços)",
      "steps": {
        "welcome": {
          "title": "Bem-vindo às Configurações de Clientes!",
          "content": "Para provedores de serviços, esta aba gerencia contas de clientes. Crie clientes, atribua sistemas e controle acesso. Cada cliente obtém dados isolados e gerenciamento de usuários!"
        },
        "section": {
          "title": "Configuração de Clientes",
          "content": "Esta seção mostra todas as suas contas de clientes. Como provedor de serviços, você pode gerenciar múltiplos clientes, cada um com seus próprios sistemas, usuários e dados. Perfeito para empresas de serviços de tratamento de água!"
        },
        "add": {
          "title": "Adicionar Novo Cliente",
          "content": "Clique aqui para criar uma nova conta de cliente. Configure informações da empresa, detalhes de contato e usuário administrador inicial. Cada cliente é totalmente isolado."
        },
        "table": {
          "title": "Tabela de Clientes",
          "content": "Visualize todos os clientes com seus nomes de empresa, informações de contato, contagens de sistemas e status. Clique para gerenciar detalhes do cliente, usuários e sistemas atribuídos."
        },
        "complete": {
          "title": "Gerenciamento de Clientes Dominado!",
          "content": "Agora você pode gerenciar múltiplas contas de clientes como provedor de serviços. Cada cliente tem acesso independente aos seus sistemas e dados!"
        }
      }
    }
  },
  "users": {
    "title": "Tour de Gerenciamento de Usuários",
    "description": "Aprenda a gerenciar contas de usuários e permissões",
    "steps": {
      "welcome": {
        "title": "Bem-vindo ao Gerenciamento de Usuários!",
        "content": "Gerencie todas as contas de usuários da sua organização nesta página. Crie usuários, atribua funções (admin, gerente, técnico) e controle permissões de acesso. Apenas administradores podem gerenciar usuários!"
      },
      "header": {
        "title": "Página de Usuários",
        "content": "Esta página mostra todas as contas de usuários com suas funções, status e atividade. Acompanhe quem tem acesso ao seu sistema de monitoramento de tratamento de água."
      },
      "export": {
        "title": "Exportar Dados de Usuários",
        "content": "Exporte sua lista de usuários para formato PDF, HTML ou CSV para documentação, auditorias ou registros de RH. Inclui detalhes dos usuários, funções e atividade de login."
      },
      "addUser": {
        "title": "Adicionar Novo Usuário",
        "content": "Clique aqui para criar uma nova conta de usuário. Defina nome, e-mail, senha, telefone e função. Usuários recebem credenciais de login e podem acessar o sistema com base nas permissões da função."
      },
      "table": {
        "title": "Tabela de Usuários",
        "content": "Visualize todos os usuários com seu ID, nome, e-mail, telefone, função, status, último login e data de criação. Usuários ativos podem fazer login, enquanto usuários inativos estão bloqueados do sistema."
      },
      "actions": {
        "title": "Ações de Usuário",
        "content": "Edite detalhes do usuário (nome, e-mail, telefone, função) ou exclua usuários que não precisam mais de acesso. Você também pode fazer upload de avatares de usuários ao editar. Cuidado - excluir um usuário é permanente!"
      },
      "complete": {
        "title": "Gerenciamento de Usuários Dominado!",
        "content": "Agora você sabe como gerenciar contas de usuários e permissões. Mantenha o acesso da sua equipe atualizado e seguro!"
      }
    }
  }
}
